{
  "irVersion": "6",
  "producerName": "pytorch",
  "producerVersion": "2.2.1",
  "graph": {
    "node": [
      {
        "output": [
          "/Constant_output_0"
        ],
        "name": "/Constant",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "2"
              ],
              "dataType": 7,
              "rawData": "//////////8QAwAAAAAAAA=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "input1",
          "/Constant_output_0"
        ],
        "output": [
          "/Reshape_output_0"
        ],
        "name": "/Reshape",
        "opType": "Reshape"
      },
      {
        "input": [
          "/Reshape_output_0",
          "fc1.weight",
          "fc1.bias"
        ],
        "output": [
          "/fc1/Gemm_output_0"
        ],
        "name": "/fc1/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "/fc1/Gemm_output_0"
        ],
        "output": [
          "/Relu_output_0"
        ],
        "name": "/Relu",
        "opType": "Relu"
      },
      {
        "input": [
          "/Relu_output_0",
          "fc2.weight",
          "fc2.bias"
        ],
        "output": [
          "output"
        ],
        "name": "/fc2/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      }
    ],
    "name": "main_graph",
    "initializer": [
      {
        "dims": [
          "500",
          "784"
        ],
        "dataType": 1,
        "name": "fc1.weight",
        "rawData": 