{
  "irVersion": "6",
  "producerName": "pytorch",
  "producerVersion": "2.0.1",
  "graph": {
    "node": [
      {
        "output": [
          "/Constant_output_0"
        ],
        "name": "/Constant",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "2"
              ],
              "dataType": 7,
              "rawData": "//////////8QAwAAAAAAAA=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "input1",
          "/Constant_output_0"
        ],
        "output": [
          "/Reshape_output_0"
        ],
        "name": "/Reshape",
        "opType": "Reshape"
      },
      {
        "output": [
          "/Constant_1_output_0"
        ],
        "name": "/Constant_1",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "BAIBPA=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/Reshape_output_0",
          "/Constant_1_output_0"
        ],
        "output": [
          "/Div_output_0"
        ],
        "name": "/Div",
        "opType": "Div"
      },
      {
        "input": [
          "/Div_output_0"
        ],
        "output": [
          "/Round_output_0"
        ],
        "name": "/Round",
        "opType": "Round"
      },
      {
        "input": [
          "/Round_output_0",
          "fc1.weight",
          "fc1.bias"
        ],
        "output": [
          "/fc1/Gemm_output_0"
        ],
        "name": "/fc1/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "/fc1/Gemm_output_0"
        ],
        "output": [
          "/Relu_output_0"
        ],
        "name": "/Relu",
        "opType": "Relu"
      },
      {
        "output": [
          "/Constant_2_output_0"
        ],
        "name": "/Constant_2",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "euyMOQ=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/Relu_output_0",
          "/Constant_2_output_0"
        ],
        "output": [
          "/Mul_output_0"
        ],
        "name": "/Mul",
        "opType": "Mul"
      },
      {
        "input": [
          "/Mul_output_0"
        ],
        "output": [
          "/Round_1_output_0"
        ],
        "name": "/Round_1",
        "opType": "Round"
      },
      {
        "output": [
          "/Constant_3_output_0"
        ],
        "name": "/Constant_3",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "AAD+wg=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "/Constant_4_output_0"
        ],
        "name": "/Constant_4",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "AAD+Qg=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/Round_1_output_0",
          "/Constant_3_output_0",
          "/Constant_4_output_0"
        ],
        "output": [
          "/Clip_output_0"
        ],
        "name": "/Clip",
        "opType": "Clip"
      },
      {
        "input": [
          "/Clip_output_0",
          "fc2.weight",
          "fc2.bias"
        ],
        "output": [
          "/fc2/Gemm_output_0"
        ],
        "name": "/fc2/Gemm",
        "opType": "Gemm",
        "attribute": [
          {
            "name": "alpha",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "beta",
            "f": 1.0,
            "type": "FLOAT"
          },
          {
            "name": "transB",
            "i": "1",
            "type": "INT"
          }
        ]
      },
      {
        "output": [
          "/Constant_5_output_0"
        ],
        "name": "/Constant_5",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "Kz7kOg=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/fc2/Gemm_output_0",
          "/Constant_5_output_0"
        ],
        "output": [
          "/Mul_1_output_0"
        ],
        "name": "/Mul_1",
        "opType": "Mul"
      },
      {
        "input": [
          "/Mul_1_output_0"
        ],
        "output": [
          "/Round_2_output_0"
        ],
        "name": "/Round_2",
        "opType": "Round"
      },
      {
        "output": [
          "/Constant_6_output_0"
        ],
        "name": "/Constant_6",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "AAD+wg=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "output": [
          "/Constant_7_output_0"
        ],
        "name": "/Constant_7",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "AAD+Qg=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/Round_2_output_0",
          "/Constant_6_output_0",
          "/Constant_7_output_0"
        ],
        "output": [
          "/Clip_1_output_0"
        ],
        "name": "/Clip_1",
        "opType": "Clip"
      },
      {
        "output": [
          "/Constant_8_output_0"
        ],
        "name": "/Constant_8",
        "opType": "Constant",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dataType": 1,
              "rawData": "HylKPg=="
            },
            "type": "TENSOR"
          }
        ]
      },
      {
        "input": [
          "/Clip_1_output_0",
          "/Constant_8_output_0"
        ],
        "output": [
          "output"
        ],
        "name": "/Mul_2",
        "opType": "Mul"
      }
    ],
    "name": "torch_jit",
    "initializer": [
      {
        "dims": [
          "500",
          "784"
        ],
        "dataType": 1,
        "name": "fc1.weight",
        "rawData": 